-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 19, 2024 at 07:25 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `bookamin`
--

-- --------------------------------------------------------

--
-- Table structure for table `article`
--

CREATE TABLE `article` (
  `id` int(11) NOT NULL,
  `fk_users_id` int(11) NOT NULL,
  `title` varchar(256) NOT NULL,
  `content` text NOT NULL,
  `img_name` varchar(32) NOT NULL,
  `publish_date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `article`
--

INSERT INTO `article` (`id`, `fk_users_id`, `title`, `content`, `img_name`, `publish_date`) VALUES
(9, 24, 'ماه', 'این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد این مرد روی ماه است و دلستر میخورد ', '158885.jpg', '2024-03-18 09:10:51'),
(10, 24, 'دایره ', 'این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است این یک دایره داینامیک است ', 'dynamic.jpg', '2024-03-18 09:11:50'),
(11, 24, 'تیر', 'این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن این های تیر های تفنگ هستن ', '110043.jpg', '2024-03-18 09:12:16'),
(12, 24, 'ببر', 'این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است این یک ببر وحشی است ', '110108.jpg', '2024-03-18 09:12:41'),
(13, 24, 'درخت قرمز', 'این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند این ها درخت های قرمز هستند ', '109676.jpg', '2024-03-18 15:36:52'),
(14, 24, 'کشتی', 'این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است این یک کشتی است ', '109694.jpg', '2024-03-18 15:39:32'),
(15, 24, 'بوروسلی', 'این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است این یک عکس از بروسلی است ', '109717.jpg', '2024-03-18 15:40:24'),
(16, 24, 'اژدها', 'این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است این یک اژدهای کوچک است ', '143003.png', '2024-03-18 15:40:58');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(32) NOT NULL,
  `email` varchar(32) NOT NULL,
  `phone_number` varchar(16) NOT NULL,
  `password` varchar(32) NOT NULL,
  `reg_date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `email`, `phone_number`, `password`, `reg_date`) VALUES
(24, 'hossein', 'hossein@gmail.com', '09123456789', '86e8f7ab32cfd12577bc2619bc635690', '2024-02-14');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `article`
--
ALTER TABLE `article`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_users_id` (`fk_users_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `article`
--
ALTER TABLE `article`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `article`
--
ALTER TABLE `article`
  ADD CONSTRAINT `article_ibfk_1` FOREIGN KEY (`fk_users_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
