<section class="py-3 py-md-5 py-xl-8">
	<div class="container">
		<div class="row gy-3 gy-md-4 gy-lg-0 align-items-lg-center">
			<div class="col-12  col-xl-5">
				<img class="img-fluid rounded" loading="lazy" src="image/converting-about-us-page.jpg" alt="">
			</div>
			<div class="col-12  col-xl-7">
				<h2 class="h1 mb-3">درباره ما</h2>
				<p class="lead fs-4 text-secondary mb-3">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود </p>
				<p class="mb-5">ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>
			</div>
		</div>
	</div>
</section>